Repository: enefry/MusicFree
Catalog: Packages/MusicFreeUI/Sources/DesignSystem/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, zh_hans

# 清理暂存、修复删除事务或清理已完成的隔离文件。
source: Clear staging, repair removal transactions, or clear finalized quarantine files.
de: Staging bereinigen, Löschvorgänge reparieren oder abgeschlossene Quarantänedateien bereinigen.
es: Limpia el área de preparación, repara las transacciones de eliminación o limpia los archivos de cuarentena finalizados.
fr: Nettoyer la zone de préparation, réparer les transactions de suppression ou supprimer les fichiers de quarantaine finalisés.
ja: ステージングを消去し、削除処理を修復するか、完了した隔離ファイルを消去します。
zh_hans: 清理暂存、修复删除事务或清理已完成的隔离文件。

# 清空播放队列
source: Clear play queue
de: Warteschlange löschen
es: Borrar cola
fr: Effacer la file d’attente
ja: 再生キューを消去
zh_hans: 清空播放队列

# 清空播放队列？
source: Clear play queue?
de: Warteschlange löschen?
es: ¿Borrar la cola?
fr: Effacer la file d’attente ?
ja: 再生キューを消去しますか？
zh_hans: 清空播放队列？

# 清空队列
source: Clear queue
de: Warteschlange löschen
es: Borrar cola
fr: Effacer la file d’attente
ja: キューを消去
zh_hans: 清空队列

# 清除
source: Clear
de: Löschen
es: Borrar
fr: Effacer
ja: 消去
zh_hans: 清除

# 清除搜索
source: Clear search
de: Suche löschen
es: Borrar búsqueda
fr: Effacer la recherche
ja: 検索を消去
zh_hans: 清除搜索

# 清除播放历史
source: Clear playback history
de: Wiedergabeverlauf löschen
es: Borrar historial de reproducción
fr: Effacer l’historique de lecture
ja: 再生履歴を消去
zh_hans: 清除播放历史

# 清除播放历史？
source: Clear playback history?
de: Wiedergabeverlauf löschen?
es: ¿Borrar el historial de reproducción?
fr: Effacer l’historique de lecture ?
ja: 再生履歴を消去しますか？
zh_hans: 清除播放历史？

# 源码
source: Source
de: Quelle
es: Fuente
ja: ソース
zh_hans: 源码

# 源码修订
source: Source revision
de: Quellrevision
es: Revisión de origen
fr: Révision de la source
ja: ソースリビジョン
zh_hans: 源码修订

# 滚动上限
source: Rolling limit
de: Rotationslimit
es: Límite de rotación
fr: Limite de rotation
ja: ローテーション上限
zh_hans: 滚动上限

# 点击文件夹进入下一级
source: Open a folder to browse deeper
de: Öffnen Sie einen Ordner, um eine Ebene tiefer zu gehen
es: Abre una carpeta para acceder al siguiente nivel
fr: Ouvrez un dossier pour accéder au niveau suivant
ja: フォルダを開くと次の階層に移動します
zh_hans: 点击文件夹进入下一级

# 点击文件夹进入下一级；导入当前文件夹会递归处理其中的音频。
source: Open a folder to browse deeper. Importing the current folder includes its audio files recursively.
de: Öffnen Sie einen Ordner, um eine Ebene tiefer zu gehen. Beim Import des aktuellen Ordners werden die darin enthaltenen Audiodateien rekursiv verarbeitet.
es: Abre una carpeta para acceder al siguiente nivel. Al importar la carpeta actual, se procesan recursivamente sus archivos de audio.
fr: Ouvrez un dossier pour accéder au niveau suivant. L’importation du dossier actuel traite récursivement les fichiers audio qu’il contient.
ja: フォルダを開くと次の階層に移動します。現在のフォルダを読み込むと、その中の音声ファイルが再帰的に処理されます。
zh_hans: 点击文件夹进入下一级；导入当前文件夹会递归处理其中的音频。

# 版本与第三方许可
source: Version and third-party licenses
de: Version und Lizenzen von Drittanbietern
es: Versión y licencias de terceros
fr: Version et licences de tiers
ja: バージョンとサードパーティライセンス
zh_hans: 版本与第三方许可

# 状态未知
source: Status unknown
de: Status unbekannt
es: Estado desconocido
fr: État inconnu
ja: 状態不明
zh_hans: 状态未知

# 现场录音
source: Live recording
de: Live-Aufnahme
es: Grabación en directo
fr: Enregistrement live
ja: ライブ録音
zh_hans: 现场录音

# 现有播放列表
source: Existing playlists
de: Vorhandene Wiedergabelisten
es: Listas de reproducción existentes
fr: Playlists existantes
ja: 既存のプレイリスト
zh_hans: 现有播放列表

# 用于匹配的歌曲元数据；具体字段取决于 Provider 实现。
source: Song metadata used for matching; the exact fields depend on the Provider implementation.
de: Für den Abgleich verwendete Songmetadaten; die genauen Felder hängen von der Provider-Implementierung ab.
es: Metadatos de canciones utilizados para la coincidencia; los campos exactos dependen de la implementación del Provider.
fr: Métadonnées des chansons utilisées pour la correspondance ; les champs exacts dépendent de l’implémentation du Provider.
ja: 照合に使用する曲のメタデータ。具体的な項目はProviderの実装によって異なります。
zh_hans: 用于匹配的歌曲元数据；具体字段取决于 Provider 实现。

# 用途
source: Purpose
de: Zweck
es: Finalidad
fr: Objectif
ja: 用途
zh_hans: 用途

# 百度网盘来源配置和 Provider 实现实际需要的数据。当前版本未提供可用的百度网盘适配器。
source: Data actually required by the Baidu Netdisk source configuration and provider implementation. This version does not provide a usable Baidu Netdisk adapter.
de: Daten, die von der Konfiguration und Implementierung des Baidu-Netdisk-Providers tatsächlich benötigt werden. Diese Version bietet keinen nutzbaren Baidu-Netdisk-Adapter.
es: Datos que realmente necesitan la configuración de la fuente y la implementación del proveedor de Baidu Netdisk. Esta versión no ofrece un adaptador utilizable para Baidu Netdisk.
fr: Données réellement nécessaires à la configuration de la source et à l’implémentation du fournisseur Baidu Netdisk. Cette version ne fournit pas d’adaptateur Baidu Netdisk utilisable.
ja: 百度ネットディスクのソース設定とProvider実装で実際に必要なデータです。現在のバージョンには利用可能な百度ネットディスクアダプタがありません。
zh_hans: 百度网盘来源配置和 Provider 实现实际需要的数据。当前版本未提供可用的百度网盘适配器。

# 目录
source: Directory
de: Verzeichnis
es: Directorio
fr: Répertoire
ja: ディレクトリ
zh_hans: 目录

# 目录与下载
source: Browse and download
de: Durchsuchen und herunterladen
es: Explorar y descargar
fr: Parcourir et télécharger
ja: ブラウズとダウンロード
zh_hans: 目录与下载

# 目录与试听
source: Browse and audition
de: Durchsuchen und anhören
es: Explorar y escuchar
fr: Parcourir et écouter
ja: ブラウズと試聴
zh_hans: 目录与试听

# 目录为空
source: Directory is empty
de: Verzeichnis ist leer
es: El directorio está vacío
fr: Le répertoire est vide
ja: ディレクトリは空です
zh_hans: 目录为空

# 目录加载失败
source: Could not load directory
de: Verzeichnis konnte nicht geladen werden
es: No se pudo cargar el directorio
fr: Impossible de charger le répertoire
ja: ディレクトリを読み込めませんでした
zh_hans: 目录加载失败

# 目录导入失败，请重试
source: Directory import failed. Try again.
de: Verzeichnisimport fehlgeschlagen. Versuchen Sie es erneut.
es: La importación del directorio ha fallado. Inténtalo de nuevo.
fr: Échec de l’importation du répertoire. Réessayez.
ja: ディレクトリの読み込みに失敗しました。もう一度お試しください
zh_hans: 目录导入失败，请重试

# 目录项
source: Directory item
de: Verzeichniselement
es: Elemento del directorio
fr: Élément du répertoire
ja: ディレクトリ項目
zh_hans: 目录项

# 碟片号
source: Disc number
de: Discnummer
es: Número de disco
fr: Numéro de disque
ja: ディスク番号
zh_hans: 碟片号

# 移除
source: Remove
de: Entfernen
es: Eliminar
fr: Supprimer
ja: 削除
zh_hans: 移除

# 移除封面
source: Remove artwork
de: Cover entfernen
es: Eliminar portada
fr: Supprimer la pochette
ja: アートワークを削除
zh_hans: 移除封面

# 移除所选
source: Remove selected
de: Auswahl entfernen
es: Eliminar selección
fr: Supprimer la sélection
ja: 選択項目を削除
zh_hans: 移除所选

# 移除所选歌曲？
source: Remove selected songs?
de: Ausgewählte Titel entfernen?
es: ¿Eliminar canciones seleccionadas?
fr: Supprimer les morceaux sélectionnés ?
ja: 選択した曲を削除しますか？
zh_hans: 移除所选歌曲？

# 第 %d 首
source: Track %d
de: Titel %d
es: Pista %d
fr: Piste %d
ja: トラック%d
zh_hans: 第 %d 首

# 第 %d 首歌曲
source: Song %d
de: Titel %d
es: Canción %d
fr: Morceau %d
ja: %d曲目
zh_hans: 第 %d 首歌曲

source: Before using online sources for the first time, allow the app to make browsing, download, and audition requests for your configured sources. Remote URLs, tokens, cookies, headers, and player access objects are used only during a single operation.
de: Bevor Sie Online-Quellen zum ersten Mal verwenden, erlauben Sie der App, für Ihre konfigurierten Quellen Anfragen zum Durchsuchen, Herunterladen und zur Vorschau zu stellen. Remote-URLs, Token, Cookies, Header und Player-Zugriffsobjekte werden nur während eines einzelnen Vorgangs verwendet.
es: Antes de usar fuentes en línea por primera vez, permite que la aplicación realice solicitudes de exploración, descarga y escucha para las fuentes configuradas. Las URL remotas, tokens, cookies, encabezados y objetos de acceso del reproductor solo se usan durante una operación.
fr: Avant d’utiliser des sources en ligne pour la première fois, autorisez l’application à effectuer des requêtes de navigation, de téléchargement et d’écoute pour les sources configurées. Les URL distantes, jetons, cookies, en-têtes et objets d’accès du lecteur ne sont utilisés que pendant une seule opération.
ja: 初めてオンラインソースを使用する前に、設定したソースへの表示・ダウンロード・試聴リクエストをアプリに許可してください。リモートURL、Token、Cookie、Header、プレーヤーアクセスオブジェクトは1回の操作中のみ使用します。
zh_hans: 第一次使用在线源前，需要允许应用为你配置的来源发起浏览、下载和试听请求。远程 URL、Token、Cookie、Header 和播放器访问对象只在一次操作期间使用。

source: Before first opening online sources or adding a source, allow the app to make browsing, download, and audition requests for your configured sources. Remote URLs, tokens, cookies, headers, and player access objects are used only during a single operation and are not written to Settings, the playback queue, or logs.
de: Bevor Sie Online-Quellen zum ersten Mal öffnen oder eine Quelle hinzufügen, erlauben Sie der App, für Ihre konfigurierten Quellen Anfragen zum Durchsuchen, Herunterladen und zur Vorschau zu stellen. Remote-URLs, Token, Cookies, Header und Player-Zugriffsobjekte werden nur während eines einzelnen Vorgangs verwendet und nicht in Einstellungen, Wiedergabewarteschlange oder Protokolle geschrieben.
es: Antes de abrir fuentes en línea por primera vez o añadir una fuente, permite que la aplicación realice solicitudes de exploración, descarga y escucha para tus fuentes configuradas. Las URL remotas, tokens, cookies, encabezados y objetos de acceso del reproductor solo se usan durante una operación y no se guardan en Ajustes, la cola de reproducción ni los registros.
fr: Avant d’ouvrir des sources en ligne ou d’ajouter une source pour la première fois, autorisez l’application à effectuer des requêtes de navigation, de téléchargement et d’écoute pour les sources configurées. Les URL distantes, jetons, cookies, en-têtes et objets d’accès du lecteur ne sont utilisés que pendant une opération et ne sont pas enregistrés dans les réglages, la file de lecture ou les journaux.
ja: 初めてオンラインソースを開くか追加する前に、設定したソースへの表示・ダウンロード・試聴リクエストをアプリに許可してください。リモートURL、Token、Cookie、Header、プレーヤーアクセスオブジェクトは1回の操作中のみ使用し、設定、再生キュー、ログには保存しません。
zh_hans: 第一次进入在线源或添加来源前，需要允许应用为你配置的来源发起浏览、下载和试听请求。远程 URL、Token、Cookie、Header 和播放器访问对象只在一次操作期间使用，不会写入设置、播放队列或日志。

# 管理完整队列
source: Manage full queue
de: Vollständige Warteschlange verwalten
es: Gestionar la cola completa
fr: Gérer la file d’attente complète
ja: 完全なキューを管理
zh_hans: 管理完整队列

# 管理播放队列
source: Manage playback queue
de: Wiedergabewarteschlange verwalten
es: Gestionar cola de reproducción
fr: Gérer la file de lecture
ja: 再生キューを管理
zh_hans: 管理播放队列

# 类型
source: Type
de: Typ
es: Tipo
ja: 種類
zh_hans: 类型

# 精选集
source: Compilation
de: Kompilation
es: Recopilación
ja: コンピレーション
zh_hans: 精选集

# 经典
source: Classic
de: Klassik
es: Clásica
fr: Classique
ja: クラシック
zh_hans: 经典

# 结束试听
source: End audition
de: Vorschau beenden
es: Finalizar escucha
fr: Terminer l’écoute
ja: 試聴を終了
zh_hans: 结束试听

# 继续
source: Continue
de: Fortfahren
es: Continuar
fr: Continuer
ja: 続ける
zh_hans: 继续

# 继续导入其他文件
source: Continue with other files
de: Mit den übrigen Dateien fortfahren
es: Continuar con los demás archivos
fr: Continuer avec les autres fichiers
ja: 他のファイルの読み込みを続ける
zh_hans: 继续导入其他文件

# 继续浏览目录
source: Continue browsing directory
de: Verzeichnis weiter durchsuchen
es: Seguir explorando el directorio
fr: Continuer à parcourir le répertoire
ja: ディレクトリの表示を続ける
zh_hans: 继续浏览目录

# 继续试听
source: Continue audition
de: Vorschau fortsetzen
es: Continuar escucha
fr: Continuer l’écoute
ja: 試聴を続ける
zh_hans: 继续试听

# 维护完成
source: Maintenance complete
de: Wartung abgeschlossen
es: Mantenimiento completado
fr: Maintenance terminée
ja: メンテナンス完了
zh_hans: 维护完成

# 缓冲中
source: Buffering
de: Puffern
es: En búfer
fr: Mise en mémoire tampon
ja: バッファリング中
zh_hans: 缓冲中

# 编号与年份
source: Numbering and year
de: Nummerierung und Jahr
es: Numeración y año
fr: Numérotation et année
ja: 番号と年
zh_hans: 编号与年份

# 编辑专辑
source: Edit Album
de: Album bearbeiten
es: Editar álbum
fr: Modifier l’album
ja: アルバムを編集
zh_hans: 编辑专辑

# 编辑播放顺序
source: Edit play order
de: Wiedergabereihenfolge bearbeiten
es: Editar orden de reproducción
fr: Modifier l’ordre de lecture
ja: 再生順を編集
zh_hans: 编辑播放顺序

# 编辑歌单
source: Edit playlist
de: Wiedergabeliste bearbeiten
es: Editar lista de reproducción
fr: Modifier la playlist
ja: プレイリストを編集
zh_hans: 编辑歌单

# 编辑歌曲
source: Edit songs
de: Songs bearbeiten
es: Editar canciones
fr: Modifier les morceaux
ja: 曲を編集
zh_hans: 编辑歌曲

# 编辑歌曲集合
source: Edit song collection
de: Song-Sammlung bearbeiten
es: Editar colección de canciones
fr: Modifier la collection de chansons
ja: 曲のコレクションを編集
zh_hans: 编辑歌曲集合

# 编辑艺人
source: Edit artists
de: Interpreten bearbeiten
es: Editar artistas
fr: Modifier les artistes
ja: アーティストを編集
zh_hans: 编辑艺人

# 网关 Provider 实现声明的目录和访问数据。当前版本未提供可用的网关适配器。
source: Directories and access data declared by the gateway provider implementation. This version does not provide a usable gateway adapter.
de: Von der Gateway-Provider-Implementierung deklarierte Verzeichnis- und Zugriffsdaten. Diese Version bietet keinen nutzbaren Gateway-Adapter.
es: Directorios y datos de acceso declarados por la implementación del proveedor de la puerta de enlace. Esta versión no ofrece un adaptador de puerta de enlace utilizable.
fr: Répertoires et données d’accès déclarés par l’implémentation du fournisseur de passerelle. Cette version ne fournit pas d’adaptateur de passerelle utilisable.
ja: ゲートウェイProvider実装が宣言するディレクトリとアクセスデータです。現在のバージョンには利用可能なゲートウェイアダプタがありません。
zh_hans: 网关 Provider 实现声明的目录和访问数据。当前版本未提供可用的网关适配器。

# 网格
source: Grid
de: Raster
es: Cuadrícula
fr: Grille
ja: グリッド
zh_hans: 网格

# 网络服务通常可以获得请求 IP 地址和 User-Agent，并按照各自的隐私政策处理请求日志。匹配结果、封面和歌词会保存到本地资料库。
source: Online services can usually receive the request IP address and User-Agent and handle request logs under their own privacy policies. Matching results, artwork, and lyrics are saved to the local library.
de: Onlinedienste können normalerweise die IP-Adresse und den User-Agent der Anfrage erhalten und Anfragelogs gemäß ihren eigenen Datenschutzrichtlinien verarbeiten. Treffer, Cover und Liedtexte werden in der lokalen Mediathek gespeichert.
es: Los servicios en línea suelen recibir la dirección IP y el User-Agent de la solicitud y tratar los registros según sus propias políticas de privacidad. Los resultados de coincidencia, las portadas y las letras se guardan en la biblioteca local.
fr: Les services en ligne peuvent généralement recevoir l’adresse IP et l’User-Agent de la requête et traiter les journaux conformément à leurs propres politiques de confidentialité. Les résultats de correspondance, les pochettes et les paroles sont enregistrés dans la bibliothèque locale.
ja: オンラインサービスは通常、リクエストのIPアドレスとUser-Agentを取得し、それぞれのプライバシーポリシーに従ってリクエストログを処理できます。照合結果、アートワーク、歌詞はローカルライブラリに保存されます。
zh_hans: 网络服务通常可以获得请求 IP 地址和 User-Agent，并按照各自的隐私政策处理请求日志。匹配结果、封面和歌词会保存到本地资料库。

# 群晖设备授权成功
source: Synology device authorized successfully
de: Synology-Gerät erfolgreich autorisiert
es: Dispositivo Synology autorizado correctamente
fr: Appareil Synology autorisé
ja: Synologyデバイスの認証に成功しました
zh_hans: 群晖设备授权成功

# 耳机
source: Headphones
de: Kopfhörer
es: Auriculares
fr: Écouteurs
ja: ヘッドフォン
zh_hans: 耳机

# 自动整理缓存
source: Automatically manage cache
de: Cache automatisch verwalten
es: Gestionar caché automáticamente
fr: Gérer automatiquement le cache
ja: キャッシュを自動管理
zh_hans: 自动整理缓存

# 自定义
source: Custom
de: Benutzerdefiniert
es: Personalizado
fr: Personnalisé
ja: カスタム
zh_hans: 自定义

# 艺人
source: Artists
de: Künstler
es: Artistas
fr: Artistes
ja: アーティスト
zh_hans: 艺人

# 艺人 %@
source: Artist %@
de: Künstler %@
es: Artista %@
fr: Artiste %@
ja: アーティスト %@
zh_hans: 艺人 %@

# 艺人加载失败
source: Could not load artist
de: Interpret konnte nicht geladen werden
es: No se pudo cargar el artista
fr: Impossible de charger l’artiste
ja: アーティストを読み込めませんでした
zh_hans: 艺人加载失败

# 艺人详情
source: Artist details
de: Künstlerdetails
es: Detalles del artista
fr: Détails de l’artiste
ja: アーティストの詳細
zh_hans: 艺人详情

# 艺人选项
source: Artist options
de: Künstleroptionen
es: Opciones del artista
fr: Options de l’artiste
ja: アーティストのオプション
zh_hans: 艺人选项

# 记录
source: Records
de: Aufnahmen
es: Discos
fr: Disques
ja: レコード
zh_hans: 记录

# 许可
source: License
de: Lizenz
es: Licencia
fr: Licence
ja: ライセンス
zh_hans: 许可

# 许可全文
source: Full license text
de: Vollständiger Lizenztext
es: Texto completo de la licencia
fr: Texte complet de la licence
ja: ライセンス全文
zh_hans: 许可全文

# 设备受限
source: Restricted on this device
de: Auf diesem Gerät eingeschränkt
es: Restringido en este dispositivo
fr: Limité sur cet appareil
ja: このデバイスでは制限されています
zh_hans: 设备受限

# 设置
source: Settings
de: Einstellungen
es: Ajustes
fr: Réglages
ja: 設定
zh_hans: 设置

# 设置保存失败。
source: Settings could not be saved.
de: Die Einstellungen konnten nicht gespeichert werden.
es: No se han podido guardar los ajustes.
fr: Les réglages n’ont pas pu être enregistrés.
ja: 設定を保存できませんでした。
zh_hans: 设置保存失败。

# 设置值不符合允许范围。
source: A settings value is outside the allowed range.
de: Ein Einstellungswert liegt außerhalb des zulässigen Bereichs.
es: Un valor de los ajustes está fuera del intervalo permitido.
fr: Une valeur de réglage est en dehors de la plage autorisée.
ja: 設定値が許容範囲外です。
zh_hans: 设置值不符合允许范围。

# 设置加载失败
source: Could not load settings
de: Einstellungen konnten nicht geladen werden
es: No se pudieron cargar los ajustes
fr: Impossible de charger les réglages
ja: 設定を読み込めませんでした
zh_hans: 设置加载失败

# 设置操作已取消。
source: The settings operation was canceled.
de: Der Einstellungsvorgang wurde abgebrochen.
es: La operación de ajustes se canceló.
fr: L’opération sur les réglages a été annulée.
ja: 設定操作をキャンセルしました。
zh_hans: 设置操作已取消。

# 设置操作无法完成。
source: The settings operation could not be completed.
de: Der Einstellungsvorgang konnte nicht abgeschlossen werden.
es: No se pudo completar la operación de ajustes.
fr: L’opération sur les réglages n’a pas pu être terminée.
ja: 設定操作を完了できませんでした。
zh_hans: 设置操作无法完成。

# 设置数据无法升级。
source: Settings data could not be migrated.
de: Einstellungsdaten konnten nicht migriert werden.
es: No se pudieron migrar los datos de ajustes.
fr: Les données de réglages n’ont pas pu être migrées.
ja: 設定データを移行できませんでした。
zh_hans: 设置数据无法升级。

# 设置数据无法读取。
source: Settings data could not be read.
de: Einstellungsdaten konnten nicht gelesen werden.
es: No se pudieron leer los datos de ajustes.
fr: Les données de réglages n’ont pas pu être lues.
ja: 設定データを読み込めませんでした。
zh_hans: 设置数据无法读取。

# 设置数据版本与当前应用不兼容。
source: The settings data version is incompatible with this app.
de: Die Version der Einstellungsdaten ist mit dieser App nicht kompatibel.
es: La versión de los datos de ajustes no es compatible con esta app.
fr: La version des données de réglages est incompatible avec cette app.
ja: 設定データのバージョンはこのアプリと互換性がありません。
zh_hans: 设置数据版本与当前应用不兼容。

# 设置读取失败。
source: Settings could not be read.
de: Die Einstellungen konnten nicht gelesen werden.
es: No se han podido leer los ajustes.
fr: Les réglages n’ont pas pu être lus.
ja: 設定を読み込めませんでした。
zh_hans: 设置读取失败。

# 设置重置失败。
source: Settings could not be reset.
de: Die Einstellungen konnten nicht zurückgesetzt werden.
es: No se han podido restablecer los ajustes.
fr: Les réglages n’ont pas pu être réinitialisés.
ja: 設定をリセットできませんでした。
zh_hans: 设置重置失败。

# 评论
source: Comment
de: Kommentar
es: Comentario
fr: Commentaire
ja: コメント
zh_hans: 评论

# 诊断信息
source: Diagnostics
de: Diagnose
es: Diagnósticos
ja: 診断情報
zh_hans: 诊断信息

# 诊断码：%@（可用于定位模拟器或 DSM 日志）
source: Diagnostic code: %@ (can be used to locate simulator or DSM logs)
de: Diagnosecode: %@ (kann zum Auffinden von Simulator- oder DSM-Protokollen verwendet werden)
es: Código de diagnóstico: %@ (se puede usar para localizar los registros del simulador o DSM)
fr: Code de diagnostic : %@ (peut servir à localiser les journaux du simulateur ou de DSM)
ja: 診断コード：%@（シミュレータまたはDSMのログ特定に使用できます）
zh_hans: 诊断码：%@（可用于定位模拟器或 DSM 日志）

# 试听
source: Audition
de: Vorschau
es: Escuchar muestra
fr: Écouter
ja: 試聴
zh_hans: 试听

# 试听中
source: Auditioning
de: Vorschau wird abgespielt
es: Escuchando
fr: Écoute en cours
ja: 試聴中
zh_hans: 试听中

# 试听失败
source: Audition failed
de: Vorschau fehlgeschlagen
es: Error al escuchar
fr: Échec de l’écoute
ja: 試聴に失敗しました
zh_hans: 试听失败

# 试听已停止
source: Audition stopped
de: Vorschau gestoppt
es: Escucha detenida
fr: Écoute arrêtée
ja: 試聴を停止しました
zh_hans: 试听已停止

# 试听进度
source: Audition progress
de: Vorschaufortschritt
es: Progreso de escucha
fr: Progression de l’écoute
ja: 試聴の進行状況
zh_hans: 试听进度

# 该专辑没有可刷新的歌曲
source: This album has no songs to refresh
de: Dieses Album enthält keine Titel zur Aktualisierung
es: Este álbum no tiene canciones que actualizar
fr: Cet album ne contient aucun morceau à actualiser
ja: このアルバムには更新できる曲がありません
zh_hans: 该专辑没有可刷新的歌曲

# 详情加载失败
source: Could not load details
de: Details konnten nicht geladen werden
es: No se pudieron cargar los detalles
fr: Impossible de charger les détails
ja: 詳細を読み込めませんでした
zh_hans: 详情加载失败

# 语言
source: Language
de: Sprache
es: Idioma
fr: Langue
ja: 言語
zh_hans: 语言

# 请先同意应用隐私协议。
source: Accept the app privacy policy first.
de: Akzeptieren Sie zuerst die Datenschutzerklärung der App.
es: Acepta primero la política de privacidad de la aplicación.
fr: Acceptez d’abord la politique de confidentialité de l’application.
ja: 先にアプリのプライバシーポリシーに同意してください。
zh_hans: 请先同意应用隐私协议。

# 请先同意应用隐私政策，在线源服务会保持关闭。
source: Accept the app privacy policy first; the online-source service will remain off.
de: Akzeptieren Sie zuerst die Datenschutzerklärung der App; der Online-Quellendienst bleibt deaktiviert.
es: Acepta primero la política de privacidad de la aplicación; el servicio de fuentes en línea permanecerá desactivado.
fr: Acceptez d’abord la politique de confidentialité de l’application ; le service de sources en ligne restera désactivé.
ja: 先にアプリのプライバシーポリシーに同意してください。オンラインソースサービスはオフのままです。
zh_hans: 请先同意应用隐私政策，在线源服务会保持关闭。

# 请先同意应用隐私政策，才能启用此 Provider。
source: Accept the app privacy policy before enabling this Provider.
de: Stimmen Sie der Datenschutzrichtlinie der App zu, bevor Sie diesen Provider aktivieren.
es: Acepta primero la política de privacidad de la app para activar este Provider.
fr: Acceptez d’abord la politique de confidentialité de l’app avant d’activer ce Provider.
ja: このProviderを有効にする前に、アプリのプライバシーポリシーに同意してください。
zh_hans: 请先同意应用隐私政策，才能启用此 Provider。

# 请先同意来源协议并启用来源。
source: Accept the source policy and enable the source first.
de: Akzeptieren Sie zuerst die Richtlinie der Quelle und aktivieren Sie die Quelle.
es: Acepta primero la política de la fuente y activa la fuente.
fr: Acceptez d’abord la politique de la source et activez-la.
ja: まずソースのポリシーに同意し、ソースを有効にしてください。
zh_hans: 请先同意来源协议并启用来源。

# 请先同意此在线源的隐私协议。
source: Accept this online source’s privacy policy first.
de: Akzeptieren Sie zuerst die Datenschutzerklärung dieser Online-Quelle.
es: Acepta primero la política de privacidad de esta fuente en línea.
fr: Acceptez d’abord la politique de confidentialité de cette source en ligne.
ja: 先にこのオンラインソースのプライバシーポリシーに同意してください。
zh_hans: 请先同意此在线源的隐私协议。

# 请先开启至少一个可用的元数据来源。
source: Enable at least one available metadata source first.
de: Aktivieren Sie zunächst mindestens eine verfügbare Metadatenquelle.
es: Activa primero al menos una fuente de metadatos disponible.
fr: Activez d’abord au moins une source de métadonnées disponible.
ja: まず利用可能なメタデータソースを1つ以上有効にしてください。
zh_hans: 请先开启至少一个可用的元数据来源。

# 请先开启至少一个歌词来源，本地歌词仍可显示。
source: Enable at least one lyrics source first. Local lyrics can still be displayed.
de: Aktivieren Sie zunächst mindestens eine Liedtextquelle. Lokale Liedtexte können weiterhin angezeigt werden.
es: Activa primero al menos una fuente de letras. Las letras locales se seguirán mostrando.
fr: Activez d’abord au moins une source de paroles. Les paroles locales peuvent toujours être affichées.
ja: まず歌詞ソースを1つ以上有効にしてください。ローカルの歌詞は引き続き表示できます。
zh_hans: 请先开启至少一个歌词来源，本地歌词仍可显示。
